<a href="https://colab.research.google.com/github/christophermalone/DSCI325/blob/main/Module3_Part1_R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Module 1 | Part 1 | R : SELECT()

This notebook will discuss the use of the SELECT() data verby in R.

<table width='100%' ><tr><td bgcolor='green'></td></tr></table>

### Example 3.1.1R
Consider the employement rates of various countries around the world. This data is presented for each quarter over a three year period. 


*   Q1: January - March
*   Q2: April - June
*   Q3: July - September
*   Q4: October - December


 
<br>Original Data Source: https://stats.oecd.org/Index.aspx?DatasetCode=STLABOUR#

<table width='100%' ><tr><td bgcolor='green'></td></tr></table>



A snipit of the <strong>OECD_EmploymentRates</strong> data set is provided here.

<p align='center'><img src="https://drive.google.com/uc?export=view&id=1yNrrUlWfNKwKIvk36IMvV_hnSQG3Vtnp"></p>

## Base R

Reading in the OECD_EmploymentRates.csv file into R using the read.csv() function in Base R.

In [17]:
EmploymentRates <- read.csv('/content/sample_data/OECD_EmploymentRates.csv')

Check that the data file was read in correctly.

In [46]:
ls()

[1] "EmploymentRates"

Using head() in R to verify that the contents of the data file were read in correctly.

In [18]:
head(EmploymentRates)

  Country   WorldRegion           Q1_Year1 Q2_Year1 Q3_Year1 Q4_Year1 Q1_Year2
1 Australia Oceania               73.7     73.6     73.7     74.0     74.1
2 Austria   Europe                72.8     73.1     73.1     73.1     73.5
3 Belgium   Europe                64.1     63.9     64.8     65.1     64.7
4 Canada    North America         73.4     73.4     73.6     73.8     73.9
5 Chile     South/Central America 64.3     64.3     63.7     64.0     63.8
6 Colombia  South/Central America 66.3     66.6     66.9     65.7     65.9
  Q2_Year2 Q3_Year2 Q4_Year2 Q1_Year3 Q2_Year3 Q3_Year3 Q4_Year3
1 74.2     74.4     74.4     74.6     70.5     72.0     73.5
2 73.6     73.5     73.6     73.2     71.4     72.7       NA
3 65.7     65.6     65.1     65.3     64.5     64.9       NA
4 74.2     74.2     74.1     73.0     64.7     70.2     72.0
5 64.2     64.4     63.9     63.3     51.2     52.6     56.3
6 65.1     65.1     64.9     63.4     50.5     56.4     59.8

To select columns and/or rows, the following syntax can be used in R.

<strong>Comment</strong>: The indexing of columns (and rows) starts with 1 in R.

<p align='center'><img src="https://drive.google.com/uc?export=view&id=1T62dv9Gb5QLQpKq9jbuDlpxC_PBFnYmi"></p>

In [ ]:
#Select columns 1 and 2.
EmploymentRates[ , 1:2]

To select rows (which is the filter data verb) consider the following slight variation.

In [20]:
EmploymentRates[1:2, ]

  Country   WorldRegion Q1_Year1 Q2_Year1 Q3_Year1 Q4_Year1 Q1_Year2 Q2_Year2
1 Australia Oceania     73.7     73.6     73.7     74.0     74.1     74.2
2 Austria   Europe      72.8     73.1     73.1     73.1     73.5     73.6
  Q3_Year2 Q4_Year2 Q1_Year3 Q2_Year3 Q3_Year3 Q4_Year3
1 74.4     74.4     74.6     70.5     72.0     73.5
2 73.5     73.6     73.2     71.4     72.7       NA

The following variation can be used to select particular columns that are not necessarily in a sequence.  Recall, the c() syntax is a vector that is used to store the desired columns to be selected.

In [ ]:
EmploymentRates[ , c(1,2, 11:14)]

The - sign can be used to negate a selection.  For example, the following is used to select <strong>all</strong> columns except columns 1 and 2.

In [ ]:
EmploymentRates[ , -1:2]

This did not work as R is unclear what your intention here.  The negation is to be applied to both columns 1 and 2 and so the following is the correct syntax for this situation.

In [ ]:
EmploymentRates[ , -c(1:2)]

## Aside: Base R Attempt to be more user friendly

<table width='100%' ><tr><td bgcolor='orange'></td></tr></table>

Base R has made a half-hearted attempt to be more user friendly.  For example, teh following will select the first two columns of the EmploymentRates dataframe using the column names.

In [ ]:
EmploymentRates[ , c("Country","WorldRegion")]

However, the negation effect is not supported.  The command EmploymentRates[ , -c(1:2)] is supported.

In [50]:
EmploymentRates[ , -c("Country","WorldRegion")]

ERROR: ignored

<table width='100%' ><tr><td bgcolor='orange'></td></tr></table>

## Tidyverse()

Loading the tidyverse() suite of package in R.

In [29]:
library(tidyverse)

Reading in the OECD_EmploymentRates.csv file into R using the read_csv() function from the tidyverse() suite of packages.

In [30]:
EmploymentRates <- read_csv('/content/sample_data/OECD_EmploymentRates.csv')

── Column specification ────────────────────────────────────────────────────────
cols(
  Country = col_character(),
  WorldRegion = col_character(),
  Q1_Year1 = col_double(),
  Q2_Year1 = col_double(),
  Q3_Year1 = col_double(),
  Q4_Year1 = col_double(),
  Q1_Year2 = col_double(),
  Q2_Year2 = col_double(),
  Q3_Year2 = col_double(),
  Q4_Year2 = col_double(),
  Q1_Year3 = col_double(),
  Q2_Year3 = col_double(),
  Q3_Year3 = col_double(),
  Q4_Year3 = col_double()
)

The select() function in dplyr package allows one to select columns by name.  Here, Country and WorldRegion are being selected.  The output is being pushed into the <strong>mysubset</strong> dataframe.

In [52]:
(
  EmploymentRates
  %>% select(Country,WorldRegion)
) -> mysubset

head(mysubset)

  Country   WorldRegion
1 Australia Oceania
2 Austria   Europe
3 Belgium   Europe
4 Canada    North America
5 Chile     South/Central America
6 Colombia  South/Central America



---

<strong>Question:</strong>

1.   How many rows are in the mysubset dataframe?



---

The following syntax is used to get all columns <strong>except</strong> WorldRegion.  Note that this syntax did *not* work in base R.

In [40]:
(
  EmploymentRates
  %>% select(-WorldRegion)
) -> mysubset

head(mysubset)

  Country   Q1_Year1 Q2_Year1 Q3_Year1 Q4_Year1 Q1_Year2 Q2_Year2 Q3_Year2
1 Australia 73.7     73.6     73.7     74.0     74.1     74.2     74.4
2 Austria   72.8     73.1     73.1     73.1     73.5     73.6     73.5
3 Belgium   64.1     63.9     64.8     65.1     64.7     65.7     65.6
4 Canada    73.4     73.4     73.6     73.8     73.9     74.2     74.2
5 Chile     64.3     64.3     63.7     64.0     63.8     64.2     64.4
6 Colombia  66.3     66.6     66.9     65.7     65.9     65.1     65.1
  Q4_Year2 Q1_Year3 Q2_Year3 Q3_Year3 Q4_Year3
1 74.4     74.6     70.5     72.0     73.5
2 73.6     73.2     71.4     72.7       NA
3 65.1     65.3     64.5     64.9       NA
4 74.1     73.0     64.7     70.2     72.0
5 63.9     63.3     51.2     52.6     56.3
6 64.9     63.4     50.5     56.4     59.8

The following variation will exclude the first two columns of the EmployementRates dataframe.

In [41]:
(
  EmploymentRates
  %>% select(-c(Country,WorldRegion))
) -> mysubset

head(mysubset)

  Q1_Year1 Q2_Year1 Q3_Year1 Q4_Year1 Q1_Year2 Q2_Year2 Q3_Year2 Q4_Year2
1 73.7     73.6     73.7     74.0     74.1     74.2     74.4     74.4
2 72.8     73.1     73.1     73.1     73.5     73.6     73.5     73.6
3 64.1     63.9     64.8     65.1     64.7     65.7     65.6     65.1
4 73.4     73.4     73.6     73.8     73.9     74.2     74.2     74.1
5 64.3     64.3     63.7     64.0     63.8     64.2     64.4     63.9
6 66.3     66.6     66.9     65.7     65.9     65.1     65.1     64.9
  Q1_Year3 Q2_Year3 Q3_Year3 Q4_Year3
1 74.6     70.5     72.0     73.5
2 73.2     71.4     72.7       NA
3 65.3     64.5     64.9       NA
4 73.0     64.7     70.2     72.0
5 63.3     51.2     52.6     56.3
6 63.4     50.5     56.4     59.8

There are certain <strong>helper</strong> functions that may be useful.  These functions naturally work with wildcards when searching.


*   starts_with() can be used to pull columns that start with a particular string
*   contains() can be used to pull columns that contain a particular string

Using the starts_with() function to select fields that starts with "Q1".

In [ ]:
(
  EmploymentRates
  %>% select(Country,WorldRegion,starts_with("Q1"))
) -> mysubset

head(mysubset)

Next, getting all columns that contains "Year1".

In [59]:
(
  EmploymentRates
  %>% select(Country,WorldRegion,contains("Year1"))
) -> mysubset

head(mysubset)

  Country   WorldRegion           Q1_Year1 Q2_Year1 Q3_Year1 Q4_Year1
1 Australia Oceania               73.7     73.6     73.7     74.0
2 Austria   Europe                72.8     73.1     73.1     73.1
3 Belgium   Europe                64.1     63.9     64.8     65.1
4 Canada    North America         73.4     73.4     73.6     73.8
5 Chile     South/Central America 64.3     64.3     63.7     64.0
6 Colombia  South/Central America 66.3     66.6     66.9     65.7

From my understanding, contains() is not able to handle logical OR statements. In this case, the <strong>matches()</strong> function can be used in place of contains.

In [60]:
(
  EmploymentRates
  %>% select(Country,WorldRegion,matches("Year1|Year2"))
) -> mysubset

head(mysubset)

  Country   WorldRegion           Q1_Year1 Q2_Year1 Q3_Year1 Q4_Year1 Q1_Year2
1 Australia Oceania               73.7     73.6     73.7     74.0     74.1
2 Austria   Europe                72.8     73.1     73.1     73.1     73.5
3 Belgium   Europe                64.1     63.9     64.8     65.1     64.7
4 Canada    North America         73.4     73.4     73.6     73.8     73.9
5 Chile     South/Central America 64.3     64.3     63.7     64.0     63.8
6 Colombia  South/Central America 66.3     66.6     66.9     65.7     65.9
  Q2_Year2 Q3_Year2 Q4_Year2
1 74.2     74.4     74.4
2 73.6     73.5     73.6
3 65.7     65.6     65.1
4 74.2     74.2     74.1
5 64.2     64.4     63.9
6 65.1     65.1     64.9